## Display Features

In [29]:
import pandas as pd
import numpy as np
import sqlite3
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt
import warnings

from xml.etree.ElementTree import fromstring, ElementTree
import xml.etree.ElementTree as ET

In [30]:
%matplotlib inline
pd.options.display.max_rows = 300000
pd.options.display.max_columns = 999
pd.options.display.max_colwidth = 500

# Load Datasets

## Players

In [31]:
players = pd.read_csv(
    "C:\\Users\\Space\\Documents\\py\\Projects\\TuringCollege\\Football\\DataSets\\players.csv",
    index_col=0,
)

In [32]:
players.head()

,PlayerID,Date,PreferredFoot,AttachWorkRate,DefenceWorkRate,Birthday,Height,Weight,BMI,OverallRating,Potential,Crossing,Finishing,HeadingAccuracy,ShortPassing,Volleys,Dribbling,Curve,FreeKickAccuracy,LongPassing,BallControl,Acceleration,SprintSpeed,Agility,Reactions,Balance,ShotPower,Jumping,Stamina,Strength,LongShots,Aggression,Interceptions,Positioning,Vision,Penalties,Marking,StandingTackle,SlidingTackle
0,2625,2007,right,high,medium,1981.0,175.26,154.0,22.74,63.0,64.0,48.0,48.0,47.0,64.0,38.0,57.0,50.0,48.5,67.0,57.0,67.0,64.0,59.0,52.0,49.0,61.0,56.0,78.0,56.0,59.0,72.0,52.0,55.0,56.0,46.0,64.0,66.0,63.0
1,2625,2008,right,high,medium,1981.0,175.26,154.0,22.74,60.0,64.0,48.0,48.0,47.0,64.0,38.0,57.0,50.0,51.0,67.0,57.0,67.0,64.0,59.0,52.0,49.0,61.0,56.0,78.0,56.0,59.0,72.0,52.0,55.0,56.0,46.0,64.0,66.0,63.0
2,2625,2010,right,high,medium,1981.0,175.26,154.0,22.74,60.0,64.0,48.0,48.0,47.0,64.0,38.0,57.0,50.0,51.0,67.0,57.0,67.0,64.0,59.0,50.0,49.0,71.0,56.0,78.0,56.0,59.0,72.0,71.0,50.0,56.0,69.0,64.0,66.0,63.0
3,2625,2011,right,high,medium,1981.0,175.26,154.0,22.74,58.5,60.5,52.0,47.0,46.0,58.0,37.0,56.0,49.0,50.0,66.0,58.0,66.0,63.0,58.0,49.0,61.5,68.0,55.0,77.0,55.0,58.0,71.0,65.0,49.0,55.0,66.0,63.0,63.0,57.0
4,2625,2012,right,medium,medium,1981.0,175.26,154.0,22.74,58.0,58.0,52.0,47.0,46.0,53.0,37.0,56.0,49.0,50.0,66.0,58.0,67.0,63.0,67.0,49.0,76.0,68.0,55.0,77.0,55.5,58.0,71.0,64.0,49.0,55.0,66.0,63.0,63.0,52.0

In [33]:
players.shape

(71615, 39)

In [34]:
overall_rating = players[["Date", "PlayerID", "OverallRating"]]

## Matches

In [35]:
matches = pd.read_csv(
    "C:\\Users\\Space\\Documents\\py\\Projects\\TuringCollege\\Football\\DataSets\\matches.csv",
    index_col=0,
)

In [36]:
sample_matches = matches[["Date", "HomePlayer1", "HomePlayer2", "HomePlayer3", "HomePlayer4", "HomePlayer5"]]

In [37]:
def overall_function(player, date, player_id, rating_column, left_dataframe, right_dataframe):

    df_merge = pd.merge(left_dataframe, right_dataframe, left_on=[date, player_id], right_on=[date, player], how='right')
    df_merge[player] = df_merge[rating_column]
    del df_merge[rating_column]
    del df_merge[player_id]

    return df_merge

In [38]:
player = "HomePlayer1"
date = "Date"
player_id = "PlayerID"
rating_column = "OverallRating"
left_dataframe = overall_rating
right_dataframe = sample_matches


df_merge = overall_function(player, date, player_id, rating_column, left_dataframe, right_dataframe)

In [39]:
df_merge.head()

   Date  HomePlayer1  HomePlayer2  HomePlayer3  HomePlayer4  HomePlayer5
0  2010         72.0      33620.0      38388.0      38389.0      38253.0
1  2010         72.0      38389.0      38253.0      69713.0      94553.0
2  2010         55.0      39977.0      93054.0      46666.0      93344.0
3  2010         69.5      67950.0      39389.0      80184.0      67941.0
4  2010         68.5      33595.0      37866.0       3329.0     149150.0

In [40]:
df_merge.shape

(18243, 6)

In [41]:
df_merge.isna().sum()

Date             0
HomePlayer1    411
HomePlayer2    299
HomePlayer3    289
HomePlayer4    324
HomePlayer5    304
dtype: int64

In [42]:
player = "HomePlayer2"
date = "Date"
player_id = "PlayerID"
rating_column = "OverallRating"
left_dataframe = overall_rating
right_dataframe = df_merge


df_merge = overall_function(player, date, player_id, rating_column, left_dataframe, right_dataframe)

In [43]:
df_merge.sort_values("Date").head()

       Date  HomePlayer1  HomePlayer2  HomePlayer3  HomePlayer4  HomePlayer5
0      2010         72.0         72.5      38388.0      38389.0      38253.0
11276  2010         65.0         56.5      68744.0          NaN      13551.0
11277  2010          NaN          NaN     150670.0          NaN          NaN
11278  2010         74.0         63.0          NaN      72543.0          NaN
11279  2010         59.0         56.0      74827.0          NaN     114827.0

In [44]:
df_merge.shape

(18243, 6)

In [45]:
df_merge.isna().sum()

Date             0
HomePlayer1    411
HomePlayer2    579
HomePlayer3    289
HomePlayer4    324
HomePlayer5    304
dtype: int64

In [46]:
player = "HomePlayer3"
date = "Date"
player_id = "PlayerID"
rating_column = "OverallRating"
left_dataframe = overall_rating
right_dataframe = df_merge


df_merge = overall_function(player, date, player_id, rating_column, left_dataframe, right_dataframe)

In [47]:
df_merge.sort_values("Date").head()

       Date  HomePlayer1  HomePlayer2  HomePlayer3  HomePlayer4  HomePlayer5
0      2010         72.0         72.5         72.0      38389.0      38253.0
11276  2010         65.0         56.5         68.0          NaN      13551.0
11277  2010          NaN          NaN         67.0          NaN          NaN
11278  2010         74.0         63.0          NaN      72543.0          NaN
11279  2010         59.0         56.0         74.0          NaN     114827.0

In [48]:
df_merge.shape

(18243, 6)

In [49]:
df_merge.isna().sum()

Date             0
HomePlayer1    411
HomePlayer2    579
HomePlayer3    462
HomePlayer4    324
HomePlayer5    304
dtype: int64

In [50]:
player = "HomePlayer4"
date = "Date"
player_id = "PlayerID"
rating_column = "OverallRating"
left_dataframe = overall_rating
right_dataframe = df_merge


df_merge = overall_function(player, date, player_id, rating_column, left_dataframe, right_dataframe)

In [51]:
df_merge.sort_values("Date").head()

       Date  HomePlayer1  HomePlayer2  HomePlayer3  HomePlayer4  HomePlayer5
0      2010         72.0         72.5         72.0         74.0      38253.0
11276  2010         65.0         56.5         68.0          NaN      13551.0
11277  2010          NaN          NaN         67.0          NaN          NaN
11278  2010         74.0         63.0          NaN         67.0          NaN
11279  2010         59.0         56.0         74.0          NaN     114827.0

In [52]:
df_merge.shape

(18243, 6)

In [53]:
df_merge.isna().sum()

Date             0
HomePlayer1    411
HomePlayer2    579
HomePlayer3    462
HomePlayer4    539
HomePlayer5    304
dtype: int64

In [54]:
player = "HomePlayer5"
date = "Date"
player_id = "PlayerID"
rating_column = "OverallRating"
left_dataframe = overall_rating
right_dataframe = df_merge


df_merge = overall_function(player, date, player_id, rating_column, left_dataframe, right_dataframe)

In [55]:
df_merge.sort_values("Date").head()

       Date  HomePlayer1  HomePlayer2  HomePlayer3  HomePlayer4  HomePlayer5
0      2010         72.0         72.5         72.0         74.0         70.5
11276  2010         65.0         56.5         68.0          NaN         60.5
11277  2010          NaN          NaN         67.0          NaN          NaN
11278  2010         74.0         63.0          NaN         67.0          NaN
11279  2010         59.0         56.0         74.0          NaN         57.0

In [56]:
df_merge.shape

(18243, 6)

In [57]:
df_merge.isna().sum()

Date             0
HomePlayer1    411
HomePlayer2    579
HomePlayer3    462
HomePlayer4    539
HomePlayer5    478
dtype: int64